# Built In Failures Analytical Model Failures Enter Positive Value Less Than Property

Source: https://www.revitapidocs.com/2026/7520abb9-4ac6-66bd-a557-ad2e882aefcc.htm

---

| Built In Failures Analytical Model Failures Enter Positive Value Less Than Property |
| --- |

Please enter a positive value less than \[Value].
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId EnterPositiveValueLessThan { get; }
```

```
Public Shared ReadOnly Property EnterPositiveValueLessThan As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ EnterPositiveValueLessThan {
	FailureDefinitionId^ get ();
}
```

```
static member EnterPositiveValueLessThan : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures AnalyticalModelFailures Class Autodesk.Revit.DB Namespace